
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_key_vault_secret.app_insights_connection_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "civil-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be destroyed
  # (because azurerm_key_vault_secret.app_insights_connection_string is not in configuration)
  - resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      - content_type            = "secret" -> null
      - id                      = "https://civil-aat.vault.azure.net/secrets/appinsights-connection-string/1479a84a33be4ec6a3dde203746f2b3c" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat" -> null
      - name                    = "appinsights-connection-string" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/appinsights-connection-string/versions/1479a84a33be4ec6a3dde203746f2b3c" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/appinsights-connection-string" -> null
      - tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git"
          - "application"         = "civil"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "appinsights civil-service-aat"
        } -> null
      - value                   = (sensitive value)
      - version                 = "1479a84a33be4ec6a3dde203746f2b3c" -> null
      - versionless_id          = "https://civil-aat.vault.azure.net/secrets/appinsights-connection-string" -> null
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat|civil-aat"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "civil-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2277,"Program":"tfcmt","SHA1":"","Vars":{}} -->